-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-02-01 17:06:28
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `baseball`
--

-- --------------------------------------------------------

--
-- 資料表結構 `course`
--

CREATE TABLE `course` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` varchar(1000) NOT NULL,
  `price` int(10) NOT NULL,
  `photo` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `course_start` datetime DEFAULT NULL,
  `course_end` datetime DEFAULT NULL,
  `type` varchar(30) NOT NULL,
  `type_id` varchar(50) NOT NULL,
  `teacher_id` varchar(50) DEFAULT NULL,
  `valid` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `course`
--

INSERT INTO `course` (`id`, `name`, `description`, `price`, `photo`, `created_at`, `course_start`, `course_end`, `type`, `type_id`, `teacher_id`, `valid`) VALUES
(1, '打擊練習教練', '25顆球', 100, '1.jpg', '2024-01-22 10:04:39', '2024-02-02 15:30:00', '2024-02-02 16:30:00', '打擊', '1', '9', 1),
(2, '打擊練習HitTrax發球機餵球', '50顆球/\r\n可即時呈現打擊數據', 200, '2.jpg', '2024-01-22 10:04:47', '2024-01-29 13:00:00', '2024-01-29 14:00:00', '打擊', '1', '20', 1),
(3, '打擊練習\n發球機餵球', '50顆球/\n可調速度', 100, '3.jpg', '2024-01-22 10:04:51', NULL, NULL, '打擊', '1', '20', 1),
(4, '打擊練習\nHitTrax教練餵球', '25顆/\n可即時呈現打擊數據', 200, '4.jpg', '2024-01-22 10:04:55', NULL, NULL, '打擊', '1', '20', 1),
(5, '守備練習教練擊球', '50顆', 100, '5.jpg', '2024-01-22 10:04:58', NULL, NULL, '守備', '3', '20', 1),
(6, '體能練習肌力體能訓練班', '固定周六\r\n1700~1800<br>\r\n1.藥球投球發力訓練<br>\r\n2.藥球打擊發力訓練<br>\r\n3.基礎速度體能訓練<br>\r\n4.基礎槓鈴訓練\r\n', 500, '6.jpg', '2024-01-17 10:05:04', '2024-02-03 17:00:00', '2024-02-03 18:00:00', '體能', '4', '9', 1),
(7, '初階課程(6Y-9Y)', '打擊守備投球綜合學習訓練<br>\r\n固定周六\r\n1300~1500', 1000, '7.jpg', '2024-01-12 10:05:08', NULL, NULL, '打擊,投球,守備', '1,2,3', '20', 1),
(8, '初階課程(10Y-12Y)', '打擊守備投球綜合學習訓練<br> 固定周六 1500~1700', 1500, '8.jpg', '2024-01-08 10:05:11', NULL, NULL, '打擊,投球,守備', '1,2,3', '20', 1),
(9, '初階課程(青年/成人)\n', '打擊守備投球綜合學習訓練<br>\n固定周六\n1500~1700', 2500, '9.jpg', '2024-01-25 10:05:16', NULL, NULL, '打擊,投球,守備', '1,2,3', '20', 1),
(10, '初階課程(女性)', '打擊守備投球綜合學習訓練<br>\n固定周日\n1500~1700', 1000, '10.jpg', '2024-01-25 10:05:20', NULL, NULL, '打擊,投球,守備', '1,2,3', '20', 1),
(11, '測速槍', '60分鐘 並含完整球道', 1100, '11.jpg', '2024-01-26 10:05:43', NULL, NULL, '投球', '2', '20', 1),
(12, '運科投手訓練班', '90分鐘(最高4人)', 1200, '12.png', '2024-01-23 10:06:41', NULL, NULL, '投球', '2', '20', 1),
(13, 'HitTrax比賽模式', '30分鐘(最高10人)', 1000, '13.png', '2024-01-24 10:06:45', NULL, NULL, '打擊', '1', '20', 1),
(14, 'HitTrax打擊訓練班', '90分鐘 ', 1000, '14.jpg', '2024-01-10 10:06:48', NULL, NULL, '打擊', '1', '20', 1),
(15, 'Rapsodo', '60分鐘<br> 投球數據完整收入分析', 2000, '15.jpg', '2024-01-16 10:06:52', NULL, NULL, '投球', '2', '20', 1),
(16, '打擊特訓班', '星期日1400~1500', 600, '16.jpg', '2024-01-17 10:06:54', '2024-02-04 14:00:00', '2024-02-04 15:00:00', '打擊', '1', '2,5,10', 1),
(17, '守備特訓班', '星期日1500~1600', 600, '16.jpg', '2024-01-17 10:06:57', '2024-02-04 15:00:00', '2024-02-04 16:00:00', '守備', '3', '2,5,10', 1),
(18, '打擊動力鏈檢核班', '六項打擊檢核重點<br>\n2/1 1900~2100 <br>\n2/3 1600~1800', 999, '17.jpg', '2024-01-18 10:07:01', '2024-02-01 19:00:00', '2024-02-01 21:00:00', '打擊', '1', '8', 1),
(19, '投手養成訓練班', '四大核心教學<br>\n星期日1700~1800', 1500, '18.jpg', '2024-01-14 10:07:04', '2024-02-04 17:00:00', '2024-02-04 18:00:00', '投球', '2', '10', 1),
(20, '守備技術班', '四點守備動作指導教學<br>\n星期六1400~1500', 1500, '19.jpg', '2024-01-15 10:07:07', '2024-02-03 14:00:00', '2024-02-03 15:00:00', '守備', '3', '5', 1),
(21, '私人教練課(投手)', '投手專項訓練<br>\n60分鐘', 1500, '20.jpg', '2024-01-03 10:07:11', NULL, NULL, '投球', '2', '4', 1),
(22, '私人教練課(野手)', '野手專項訓練<br>\n60分鐘', 1500, '21.jpg', '2024-01-04 10:07:13', NULL, NULL, '守備', '3', '3', 1),
(23, '守備技術班(N4)', '四點守備動作指導教學<br>\n星期六1400~1500', 1500, '22.jpg', '2024-01-05 10:07:16', '2024-02-03 14:00:00', '2024-02-03 15:00:00', '守備', '3', '5', 1),
(24, '打擊初速提升班', '穩定提升擊球初速<br>\n星期一 1900~2100<br>\n星期四 1900~2100', 3000, '23.jpg', '2024-01-06 10:07:18', NULL, NULL, '打擊', '1', '7', 1),
(25, '超猛打擊訓練', '超級生猛的打擊訓練課程', 2800, 'A4.jpg', '2024-01-29 15:08:44', '2024-01-29 15:00:00', '2024-01-29 15:00:00', '打擊', '1', '1', 1),
(26, '超猛投球訓練', '超級生猛的投球訓練課程', 3500, 'A3.jpg', '2024-01-29 15:10:38', '2024-01-30 15:10:00', '2024-01-30 17:10:00', '投球', '2', '7', 1),
(27, '超猛守備訓練', '超級生猛的守備訓練課程', 2600, '1706680318.webp', '2024-01-31 13:51:58', '2024-02-10 13:00:00', '2024-02-10 15:00:00', '守備', '3', '8', 1),
(28, '超猛打擊訓練2', '超級生猛的打擊訓練課程', 2400, '1706685305.jpg', '2024-01-31 15:15:05', '2024-01-31 21:30:00', '2024-01-31 21:30:00', '打擊', '1', '2', 1),
(29, '少棒守備技術班12', '針對守備要領強化訓練<br>\r\n基礎守備動作加強<br>\r\n正、反手接球動作加強', 2600, '19.jpg', '2024-02-01 13:50:07', '2024-02-06 13:00:00', '2024-02-06 15:00:00', '守備,體能', '', '9', 1),
(30, '少棒守備技術班15', '針對守備要領強化訓練<br>\n基礎守備動作加強<br>\n正、反手接球動作加強', 2700, '19.jpg', '2024-02-01 13:55:08', '2024-02-01 13:54:00', '2024-02-01 15:54:00', '守備,體能', '', '7', 1),
(31, '打擊動力練檢核班', '六大檢核項目', 999, '1706767085.jpg', '2024-02-01 13:58:05', '2024-02-01 13:57:00', '2024-02-01 16:57:00', '打擊,知識', '', '8', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `course`
--
ALTER TABLE `course`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
